#!/usr/bin/env python
# coding: UTF-8

#####################################################################################################################
#このノードは．WS内環境認識サブシステムを作成したモジュールです．　　　　　　　　　　　　　　　 #
#===================================================================================================================#
#バージョン管理
#===================================================================================================================#
#ver. 0.1:  基本実装（Linux版）　　　2023/09/28
#===================================================================================================================#
#依存ノード
#===================================================================================================================#
#このノードはLinuxでのみ利用可能です．
#===================================================================================================================#

#python,TFのライブラリを使用
import rospy
from rospy.topics import Publisher, Subscriber

from std_msgs.msg import *
from geometry_msgs.msg import *

def send_ws_recognise():
    pub = rospy.Publisher('recg_data',Float32 , queue_size=10)
    rospy.init_node('ws_recognise', anonymous=True)
    r = rospy.Rate(1) # 1hz
    while not rospy.is_shutdown():
        sensor = Float32()
        sensor.data= 1.0
        pub.publish(sensor)
        r.sleep()

if __name__ == '__main__':
    try:
        send_ws_recognise()
    except rospy.ROSInterruptException: pass
